<?php
//Самая длинная строка подстрока без повторяющихся символов
//Вернуть массивом подстроки
//MySQL как работают медленные запросы, индексы, джоины, фибоначи, окружение линукс,
//можно ли писать константу в трейтах, интерфейсах
//https://phptherightway.com/pages/Design-Patterns.html - паттерны(пораждающие, структурные, поведенчиские)
//Какие паттерны ты встречал в фреймворке в котором работал
//git push, origin, master
//composer.lock, composer.json
//RegExp +
//Unit test +
// phptherightway guides
//MB префикс для всех строковых функций
//Как правильно писать эксепшны
//the twelve factor app

